//
//  LocationData.swift
//  DeepFashion
//
//  Created by MinKyeongTae on 2019/12/30.
//  Copyright © 2019 MinKyeongTae. All rights reserved.
//

import Foundation

typealias Coordinator = (String, Double, Double)
struct LocationData {
    static let coordinatorList: [Int: Coordinator] = [
        18: ("남해", 34.837672, 127.892423),
        19: ("대관령", 37.687137, 128.760571),
        20: ("대구", 35.871435, 128.601445),
        21: ("대전", 36.350412, 127.384548),
        36: ("북창원", 35.245595, 128.691953),
        37: ("북춘천", 37.880344, 127.74983),
        38: ("산청", 35.415589, 127.873498),
        39: ("상주", 36.410947, 128.159083),
        40: ("서귀포", 33.254121, 126.560076),
        41: ("서산", 36.784499, 126.450317),
        42: ("서울", 37.566535, 126.977969),
        43: ("성산", 33.381063, 126.876856),
        44: ("속초", 38.207015, 128.591849),
        45: ("수원", 37.263573, 127.028601),
        46: ("순창군", 35.374414, 127.137597),
        47: ("순천", 34.950637, 127.487214),
    ]
}
